GopalSaraf/Practicals/PSDL/include/proc/pic16lf15375.h
extern volatile SSP1SSPPSbits_t SSP1SSPPSbits __at(0x1EC7);
// bitfield macros
#define _SSP1SSPPS_SSP1SSPPS_POSN                           0x0
#define _SSP1SSPPS_SSP1SSPPS_POSITION                       0x0
#define _SSP1SSPPS_SSP1SSPPS_SIZE                           0x6
#define _SSP1SSPPS_SSP1SSPPS_LENGTH                         0x6
#define _SSP1SSPPS_SSP1SSPPS_MASK                           0x3F
#define _SSP1SSPPS_SSP1SSPPS0_POSN                          0x0
#define _SSP1SSPPS_SSP1SSPPS0_POSITION                      0x0
#define _SSP1SSPPS_SSP1SSPPS0_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS0_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS0_MASK                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSN                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSITION                      0x1
#define _SSP1SSPPS_SSP1SSPPS1_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS1_MASK                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSN                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSITION                      0x2
#define _SSP1SSPPS_SSP1SSPPS2_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS2_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS2_MASK                          0x4
#define _SSP1SSPPS_SSP1SSPPS3_POSN                          0x3
#define _SSP1SSPPS_SSP1SSPPS3_POSITION                      0x3
#define _SSP1SSPPS_SSP1SSPPS3_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS3_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS3_MASK                          0x8
#define _SSP1SSPPS_SSP1SSPPS4_POSN                          0x4
#define _SSP1SSPPS_SSP1SSPPS4_POSITION                      0x4
#define _SSP1SSPPS_SSP1SSPPS4_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS4_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS4_MASK                          0x10
#define _SSP1SSPPS_SSP1SSPPS5_POSN                          0x5
#define _SSP1SSPPS_SSP1SSPPS5_POSITION                      0x5
#define _SSP1SSPPS_SSP1SSPPS5_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS5_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS5_MASK                          0x20

// Register: SSP2CLKPPS
#define SSP2CLKPPS SSP2CLKPPS
extern volatile unsigned char           SSP2CLKPPS          __at(0x1EC8);
#ifndef _LIB_BUILD
asm("SSP2CLKPPS equ 01EC8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2CLKPPS             :6;
    };
    struct {
        unsigned SSP2CLKPPS0            :1;
        unsigned SSP2CLKPPS1            :1;
        unsigned SSP2CLKPPS2            :1;
        unsigned SSP2CLKPPS3            :1;
        unsigned SSP2CLKPPS4            :1;
        unsigned SSP2CLKPPS5            :1;
    };
} SSP2CLKPPSbits_t;
extern volatile SSP2CLKPPSbits_t SSP2CLKPPSbits __at(0x1EC8);
// bitfield macros
#define _SSP2CLKPPS_SSP2CLKPPS_POSN                         0x0
#define _SSP2CLKPPS_SSP2CLKPPS_POSITION                     0x0
#define _SSP2CLKPPS_SSP2CLKPPS_SIZE                         0x6
#define _SSP2CLKPPS_SSP2CLKPPS_LENGTH                       0x6
#define _SSP2CLKPPS_SSP2CLKPPS_MASK                         0x3F
#define _SSP2CLKPPS_SSP2CLKPPS0_POSN                        0x0
#define _SSP2CLKPPS_SSP2CLKPPS0_POSITION                    0x0
#define _SSP2CLKPPS_SSP2CLKPPS0_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS0_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS0_MASK                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_POSN                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_POSITION                    0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS1_MASK                        0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_POSN                        0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_POSITION                    0x2
#define _SSP2CLKPPS_SSP2CLKPPS2_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS2_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS2_MASK                        0x4
#define _SSP2CLKPPS_SSP2CLKPPS3_POSN                        0x3
#define _SSP2CLKPPS_SSP2CLKPPS3_POSITION                    0x3
#define _SSP2CLKPPS_SSP2CLKPPS3_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS3_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS3_MASK                        0x8
#define _SSP2CLKPPS_SSP2CLKPPS4_POSN                        0x4
#define _SSP2CLKPPS_SSP2CLKPPS4_POSITION                    0x4
#define _SSP2CLKPPS_SSP2CLKPPS4_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS4_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS4_MASK                        0x10
#define _SSP2CLKPPS_SSP2CLKPPS5_POSN                        0x5
#define _SSP2CLKPPS_SSP2CLKPPS5_POSITION                    0x5
#define _SSP2CLKPPS_SSP2CLKPPS5_SIZE                        0x1
#define _SSP2CLKPPS_SSP2CLKPPS5_LENGTH                      0x1
#define _SSP2CLKPPS_SSP2CLKPPS5_MASK                        0x20

// Register: SSP2DATPPS
#define SSP2DATPPS SSP2DATPPS
extern volatile unsigned char           SSP2DATPPS          __at(0x1EC9);
#ifndef _LIB_BUILD
asm("SSP2DATPPS equ 01EC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2DATPPS             :6;
    };
    struct {
        unsigned SSP2DATPPS0            :1;
        unsigned SSP2DATPPS1            :1;
        unsigned SSP2DATPPS2            :1;
        unsigned SSP2DATPPS3            :1;
        unsigned SSP2DATPPS4            :1;
        unsigned SSP2DATPPS5            :1;
    };
} SSP2DATPPSbits_t;
extern volatile SSP2DATPPSbits_t SSP2DATPPSbits __at(0x1EC9);
// bitfield macros
#define _SSP2DATPPS_SSP2DATPPS_POSN                         0x0
#define _SSP2DATPPS_SSP2DATPPS_POSITION                     0x0
#define _SSP2DATPPS_SSP2DATPPS_SIZE                         0x6
#define _SSP2DATPPS_SSP2DATPPS_LENGTH                       0x6
#define _SSP2DATPPS_SSP2DATPPS_MASK                         0x3F
#define _SSP2DATPPS_SSP2DATPPS0_POSN                        0x0
#define _SSP2DATPPS_SSP2DATPPS0_POSITION                    0x0
#define _SSP2DATPPS_SSP2DATPPS0_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS0_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS0_MASK                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_POSN                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_POSITION                    0x1
#define _SSP2DATPPS_SSP2DATPPS1_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS1_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS1_MASK                        0x2
#define _SSP2DATPPS_SSP2DATPPS2_POSN                        0x2
#define _SSP2DATPPS_SSP2DATPPS2_POSITION                    0x2
#define _SSP2DATPPS_SSP2DATPPS2_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS2_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS2_MASK                        0x4
#define _SSP2DATPPS_SSP2DATPPS3_POSN                        0x3
#define _SSP2DATPPS_SSP2DATPPS3_POSITION                    0x3
#define _SSP2DATPPS_SSP2DATPPS3_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS3_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS3_MASK                        0x8
#define _SSP2DATPPS_SSP2DATPPS4_POSN                        0x4
#define _SSP2DATPPS_SSP2DATPPS4_POSITION                    0x4
#define _SSP2DATPPS_SSP2DATPPS4_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS4_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS4_MASK                        0x10
#define _SSP2DATPPS_SSP2DATPPS5_POSN                        0x5
#define _SSP2DATPPS_SSP2DATPPS5_POSITION                    0x5
#define _SSP2DATPPS_SSP2DATPPS5_SIZE                        0x1
#define _SSP2DATPPS_SSP2DATPPS5_LENGTH                      0x1
#define _SSP2DATPPS_SSP2DATPPS5_MASK                        0x20

// Register: SSP2SSPPS
#define SSP2SSPPS SSP2SSPPS
extern volatile unsigned char           SSP2SSPPS           __at(0x1ECA);
#ifndef _LIB_BUILD
asm("SSP2SSPPS equ 01ECAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2SSPPS              :6;
    };
    struct {
        unsigned SSP2SSPPS0             :1;
        unsigned SSP2SSPPS1             :1;
        unsigned SSP2SSPPS2             :1;
        unsigned SSP2SSPPS3             :1;
        unsigned SSP2SSPPS4             :1;
        unsigned SSP2SSPPS5             :1;
    };
} SSP2SSPPSbits_t;
extern volatile SSP2SSPPSbits_t SSP2SSPPSbits __at(0x1ECA);
// bitfield macros
#define _SSP2SSPPS_SSP2SSPPS_POSN                           0x0
#define _SSP2SSPPS_SSP2SSPPS_POSITION                       0x0
#define _SSP2SSPPS_SSP2SSPPS_SIZE                           0x6
#define _SSP2SSPPS_SSP2SSPPS_LENGTH                         0x6
#define _SSP2SSPPS_SSP2SSPPS_MASK                           0x3F
#define _SSP2SSPPS_SSP2SSPPS0_POSN                          0x0
#define _SSP2SSPPS_SSP2SSPPS0_POSITION                      0x0
#define _SSP2SSPPS_SSP2SSPPS0_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS0_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS0_MASK                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_POSN                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_POSITION                      0x1
#define _SSP2SSPPS_SSP2SSPPS1_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS1_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS1_MASK                          0x2
#define _SSP2SSPPS_SSP2SSPPS2_POSN                          0x2
#define _SSP2SSPPS_SSP2SSPPS2_POSITION                      0x2
#define _SSP2SSPPS_SSP2SSPPS2_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS2_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS2_MASK                          0x4
#define _SSP2SSPPS_SSP2SSPPS3_POSN                          0x3
#define _SSP2SSPPS_SSP2SSPPS3_POSITION                      0x3
#define _SSP2SSPPS_SSP2SSPPS3_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS3_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS3_MASK                          0x8
#define _SSP2SSPPS_SSP2SSPPS4_POSN                          0x4
#define _SSP2SSPPS_SSP2SSPPS4_POSITION                      0x4
#define _SSP2SSPPS_SSP2SSPPS4_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS4_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS4_MASK                          0x10
#define _SSP2SSPPS_SSP2SSPPS5_POSN                          0x5
#define _SSP2SSPPS_SSP2SSPPS5_POSITION                      0x5
#define _SSP2SSPPS_SSP2SSPPS5_SIZE                          0x1
#define _SSP2SSPPS_SSP2SSPPS5_LENGTH                        0x1
#define _SSP2SSPPS_SSP2SSPPS5_MASK                          0x20

// Register: RX1DTPPS
#define RX1DTPPS RX1DTPPS
extern volatile unsigned char           RX1DTPPS            __at(0x1ECB);
#ifndef _LIB_BUILD
asm("RX1DTPPS equ 01ECBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX1DTPPS               :6;
    };
    struct {
        unsigned RX1DTPPS0              :1;
        unsigned RX1DTPPS1              :1;
        unsigned RX1DTPPS2              :1;
        unsigned RX1DTPPS3              :1;
        unsigned RX1DTPPS4              :1;
        unsigned RX1DTPPS5              :1;
    };
} RX1DTPPSbits_t;
extern volatile RX1DTPPSbits_t RX1DTPPSbits __at(0x1ECB);
// bitfield macros
#define _RX1DTPPS_RX1DTPPS_POSN                             0x0
#define _RX1DTPPS_RX1DTPPS_POSITION                         0x0
#define _RX1DTPPS_RX1DTPPS_SIZE                             0x6
#define _RX1DTPPS_RX1DTPPS_LENGTH                           0x6
#define _RX1DTPPS_RX1DTPPS_MASK                             0x3F
#define _RX1DTPPS_RX1DTPPS0_POSN                            0x0
#define _RX1DTPPS_RX1DTPPS0_POSITION                        0x0
#define _RX1DTPPS_RX1DTPPS0_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS0_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS0_MASK                            0x1
#define _RX1DTPPS_RX1DTPPS1_POSN                            0x1
#define _RX1DTPPS_RX1DTPPS1_POSITION                        0x1
#define _RX1DTPPS_RX1DTPPS1_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS1_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS1_MASK                            0x2
#define _RX1DTPPS_RX1DTPPS2_POSN                            0x2
#define _RX1DTPPS_RX1DTPPS2_POSITION                        0x2
#define _RX1DTPPS_RX1DTPPS2_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS2_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS2_MASK                            0x4
#define _RX1DTPPS_RX1DTPPS3_POSN                            0x3
#define _RX1DTPPS_RX1DTPPS3_POSITION                        0x3
#define _RX1DTPPS_RX1DTPPS3_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS3_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS3_MASK                            0x8
#define _RX1DTPPS_RX1DTPPS4_POSN                            0x4
#define _RX1DTPPS_RX1DTPPS4_POSITION                        0x4
#define _RX1DTPPS_RX1DTPPS4_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS4_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS4_MASK                            0x10
#define _RX1DTPPS_RX1DTPPS5_POSN                            0x5
#define _RX1DTPPS_RX1DTPPS5_POSITION                        0x5
#define _RX1DTPPS_RX1DTPPS5_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS5_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS5_MASK                            0x20

// Register: TX1CKPPS
#define TX1CKPPS TX1CKPPS
extern volatile unsigned char           TX1CKPPS            __at(0x1ECC);
#ifndef _LIB_BUILD
asm("TX1CKPPS equ 01ECCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX1CKPPS               :6;
    };
    struct {
        unsigned TX1CKPPS0              :1;
        unsigned TX1CKPPS1              :1;
        unsigned TX1CKPPS2              :1;
        unsigned TX1CKPPS3              :1;
        unsigned TX1CKPPS4              :1;
        unsigned TX1CKPPS5              :1;
    };
} TX1CKPPSbits_t;
extern volatile TX1CKPPSbits_t TX1CKPPSbits __at(0x1ECC);
// bitfield macros
#define _TX1CKPPS_TX1CKPPS_POSN                             0x0
#define _TX1CKPPS_TX1CKPPS_POSITION                         0x0
#define _TX1CKPPS_TX1CKPPS_SIZE                             0x6
#define _TX1CKPPS_TX1CKPPS_LENGTH                           0x6
#define _TX1CKPPS_TX1CKPPS_MASK                             0x3F
#define _TX1CKPPS_TX1CKPPS0_POSN                            0x0
#define _TX1CKPPS_TX1CKPPS0_POSITION                        0x0
#define _TX1CKPPS_TX1CKPPS0_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS0_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS0_MASK                            0x1
#define _TX1CKPPS_TX1CKPPS1_POSN                            0x1
#define _TX1CKPPS_TX1CKPPS1_POSITION                        0x1
#define _TX1CKPPS_TX1CKPPS1_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS1_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS1_MASK                            0x2
#define _TX1CKPPS_TX1CKPPS2_POSN                            0x2
#define _TX1CKPPS_TX1CKPPS2_POSITION                        0x2
#define _TX1CKPPS_TX1CKPPS2_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS2_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS2_MASK                            0x4
#define _TX1CKPPS_TX1CKPPS3_POSN                            0x3
#define _TX1CKPPS_TX1CKPPS3_POSITION                        0x3
#define _TX1CKPPS_TX1CKPPS3_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS3_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS3_MASK                            0x8
#define _TX1CKPPS_TX1CKPPS4_POSN                            0x4
#define _TX1CKPPS_TX1CKPPS4_POSITION                        0x4
#define _TX1CKPPS_TX1CKPPS4_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS4_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS4_MASK                            0x10
#define _TX1CKPPS_TX1CKPPS5_POSN                            0x5
#define _TX1CKPPS_TX1CKPPS5_POSITION                        0x5
#define _TX1CKPPS_TX1CKPPS5_SIZE                            0x1
#define _TX1CKPPS_TX1CKPPS5_LENGTH                          0x1
#define _TX1CKPPS_TX1CKPPS5_MASK                            0x20

// Register: RX2DTPPS
#define RX2DTPPS RX2DTPPS
extern volatile unsigned char           RX2DTPPS            __at(0x1ECD);
#ifndef _LIB_BUILD
asm("RX2DTPPS equ 01ECDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX2DTPPS               :6;
    };
    struct {
        unsigned RX2DTPPS0              :1;
        unsigned RX2DTPPS1              :1;
        unsigned RX2DTPPS2              :1;
        unsigned RX2DTPPS3              :1;
        unsigned RX2DTPPS4              :1;
        unsigned RX2DTPPS5              :1;
    };
} RX2DTPPSbits_t;
